In [18]:
import pandas as pd
import matplotlib.pyplot as plt

df = pd.read_csv(r'C:\Users\singh\Documents\DATA ANALYTICS BOOTCAMP\data_jobs.csv')

# converting the job_posted_date object to datetime
df['job_posted_date'] = pd.to_datetime(df.job_posted_date)

In [3]:
df[pd.notna(df['salary_year_avg'])]['salary_year_avg']

28        109500.0
77        140000.0
92        120000.0
100       228222.0
109        89000.0
            ...
785624    139216.0
785641    150000.0
785648    221875.0
785682    157500.0
785692    157500.0
Name: salary_year_avg, Length: 22003, dtype: float64

Now we want to project the salary year avg for the next year using the apply() function

In [8]:
df_salary = df[pd.notna(df['salary_year_avg'])].copy()

def salary_calc(salary):
  return salary*1.03


# df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(salary_calc)

# df_salary[['salary_year_avg', 'salary_year_inflated']]

In [9]:
# we can also use the lambda function 
df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(lambda salary: salary*1.03)
df_salary[['salary_year_avg', 'salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

In [19]:
# Now converting the job_skills col from string to list
type(df['job_skills'][1])

import ast

# def list_conv(skill_set):
#   if pd.notna(skill_set):
#     return ast.literal_eval(skill_set)
  
# df['job_skills'] = df['job_skills'].apply(list_conv)
# df['job_skills'][1]

# using the lambda function
df['job_skills'] = df['job_skills'].apply(lambda skill: ast.literal_eval(skill) if pd.notna(skill) else skill)
df['job_skills'][1]

['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']

Apply() method on a row

In [26]:
def salary_inflation(row):
  if "Senior" in row['job_title_short']:
    return 1.05 * row['salary_year_avg']
  else:
    return 1.03 * row['salary_year_avg']

df['salary_year_inflation'] = df.apply(salary_inflation, axis = 1)
df[pd.notna(df['salary_year_avg'])][['job_title_short', 'salary_year_avg', 'salary_year_inflation']]

       job_title_short  salary_year_avg  salary_year_inflation
28      Data Scientist         109500.0              112785.00
77       Data Engineer         140000.0              144200.00
92       Data Engineer         120000.0              123600.00
100     Data Scientist         228222.0              235068.66
109       Data Analyst          89000.0               91670.00
...                ...              ...                    ...
785624   Data Engineer         139216.0              143392.48
785641   Data Engineer         150000.0              154500.00
785648  Data Scientist         221875.0              228531.25
785682  Data Scientist         157500.0              162225.00
785692  Data Scientist         157500.0              162225.00

[22003 rows x 3 columns]